dwijaybane/msp430/Source Files/eusci_uart.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2012, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
//uart.c - Driver for the UART Module.
//
//*****************************************************************************
//#include "inc/hw_types.h"
#include "debug.h"
#include "eusci_uart.h"
#include "eusci_euartbaudrate.h"
#ifdef  __IAR_SYSTEMS_ICC__
#include "deprecated/IAR/msp430xgeneric.h"
#else
#include "msp430xgeneric.h"
#endif

//*************************UART A0 ISR **************************************//
#pragma vector=USCI_A0_VECTOR
__interrupt void USCI_A0_ISR (void)
{
	unsigned int get_che_status;
    switch (__even_in_range(UCA0IV, 4))
	{
	case USCI_UART_UCTXIFG:
	{
		EUSCI_UART_enableInterrupt(EUSCI_A0_BASE,EUSCI_UART_RECEIVE_INTERRUPT);
		break;
	}
	case USCI_UART_UCRXIFG:
	{
		r_flag = 1;
		EUSCI_UART_enableInterrupt(EUSCI_A0_BASE,EUSCI_UART_TRANSMIT_INTERRUPT);
		break;
	}
	default: break;
	}
}

//*************************UART A1 ISR **************************************//
#pragma vector=USCI_A1_VECTOR
__interrupt void USCI_A1_ISR (void)
{
	unsigned int get_che_status;
    switch (__even_in_range(UCA1IV, 4))
	{
	case USCI_UART_UCTXIFG:
	{
		EUSCI_UART_enableInterrupt(EUSCI_A1_BASE,EUSCI_UART_RECEIVE_INTERRUPT);
		break;
	}
	case USCI_UART_UCRXIFG:
	{
		r_flag = 1;
		uarta1_buffer[index++] = UCA1RXBUF;
		EUSCI_UART_enableInterrupt(EUSCI_A1_BASE,EUSCI_UART_TRANSMIT_INTERRUPT);
		break;
	}
	default: break;
	}
}
//*****************************************************************************
//
//! Initializes the UART block.
//!
//! \param baseAddress is the base address of the UART module.
//! \param selectClockSource selects Clock source. Valid values are
//!         \b EUSCI_UART_CLOCKSOURCE_SMCLK
//!         \b EUSCI_UART_CLOCKSOURCE_ACLK
//! \param clockSourceFrequency is the frequency of the slected clock source
//! \param desiredUartClock is the desired clock rate for UART communication
//! \param parity is the desired parity. Valid values are
//!        \b EUSCI_UART_NO_PARITY  [Default Value],
//!        \b EUSCI_UART_ODD_PARITY,
//!        \b EUSCI_UART_EVEN_PARITY
//! \param msborLsbFirst controls direction of receive and transmit shift
//!     register. Valid values are
//!        \b EUSCI_UART_MSB_FIRST
//!        \b EUSCI_UART_LSB_FIRST [Default Value]
//! \param numberofStopBits indicates one/two STOP bits
//!      Valid values are
//!        \b EUSCI_UART_ONE_STOP_BIT [Default Value]
//!        \b EUSCI_UART_TWO_STOP_BITS
//! \param uartMode selects the mode of operation
//!      Valid values are
//!        \b EUSCI_UART_MODE  [Default Value],
//!        \b EUSCI_UART_IDLE_LINE_MULTI_PROCESSOR_MODE,
//!        \b EUSCI_UART_ADDRESS_BIT_MULTI_PROCESSOR_MODE,
//!        \b EUSCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE
//! \param overSampling indicates low frequency or oversampling baud generation
//!      Valid values are
//!        \b EUSCI_UART_OVERSAMPLING_BAUDRATE_GENERATION
//!        \b EUSCI_UART_LOW_FREQUENCY_BAUDRATE_GENERATION
//!
//! Upon successful initialization of the UART block, this function
//! will have initialized the module, but the UART block still remains
//! disabled and must be enabled with EUSCI_UART_enable()
//!
//! Modified bits are \b UCPEN, \b UCPAR, \b UCMSB, \b UC7BIT, \b UCSPB,
//! \b UCMODEx, \b UCSYNC bits of \b UCAxCTL0 and \b UCSSELx,
//! \b UCSWRST bits of \b UCAxCTL1
//!
//! \return STATUS_SUCCESS or
//!         STATUS_FAIL of the initialization process
//
//*****************************************************************************
unsigned short EUSCI_UART_init ( unsigned int baseAddress,
    unsigned char selectClockSource,
    unsigned long clockSourceFrequency,
    unsigned long desiredUartBaudRate,
    unsigned char parity,
    unsigned int msborLsbFirst,
    unsigned int numberofStopBits,
    unsigned int uartMode,
    unsigned short overSampling
    )
{
    ASSERT(
        (EUSCI_UART_MODE == uartMode) ||
        (EUSCI_UART_IDLE_LINE_MULTI_PROCESSOR_MODE == uartMode) ||
        (EUSCI_UART_ADDRESS_BIT_MULTI_PROCESSOR_MODE == uartMode) ||
        (EUSCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE == uartMode)
        );

    ASSERT(
        (EUSCI_UART_CLOCKSOURCE_ACLK == selectClockSource) ||
        (EUSCI_UART_CLOCKSOURCE_SMCLK == selectClockSource)
        );

    ASSERT(
        (EUSCI_UART_MSB_FIRST == msborLsbFirst) ||
        (EUSCI_UART_LSB_FIRST == msborLsbFirst)
        );

    ASSERT(
        (EUSCI_UART_ONE_STOP_BIT == numberofStopBits) ||
        (EUSCI_UART_TWO_STOP_BITS == numberofStopBits)
        );

    ASSERT(
        (EUSCI_UART_NO_PARITY == parity) ||
        (EUSCI_UART_ODD_PARITY == parity) ||
        (EUSCI_UART_EVEN_PARITY == parity)
        );


    unsigned char retVal = STATUS_SUCCESS;
    unsigned int UCAxBRW_value = 0x00;
    unsigned int UCAxMCTL_value = 0x00;

