dwijaybane/msp430/Source Files/eusci_uart.c
    //Disable the USCI Module
    HWREG(baseAddress + OFS_UCAxCTLW0) |= UCSWRST;

    //Clock source select
    HWREG(baseAddress + OFS_UCAxCTLW0) &= ~UCSSEL_3;
    HWREG(baseAddress + OFS_UCAxCTLW0) |= selectClockSource;

    //MSB, LSB select
    HWREG(baseAddress + OFS_UCAxCTLW0) &= ~UCMSB;
    HWREG(baseAddress + OFS_UCAxCTLW0) |= msborLsbFirst;


    //UCSPB = 0(1 stop bit) OR 1(2 stop bits)
    HWREG(baseAddress + OFS_UCAxCTLW0) &= ~UCSPB;
    HWREG(baseAddress + OFS_UCAxCTLW0) |= numberofStopBits;


    //Parity
    switch (parity){
        case EUSCI_UART_NO_PARITY:
            //No Parity
            HWREG(baseAddress + OFS_UCAxCTLW0) &= ~UCPEN;
            break;
        case EUSCI_UART_ODD_PARITY:
            //Odd Parity
            HWREG(baseAddress + OFS_UCAxCTLW0) |= UCPEN;
            HWREG(baseAddress + OFS_UCAxCTLW0) &= ~UCPAR;
            break;
        case EUSCI_UART_EVEN_PARITY:
            //Even Parity
            HWREG(baseAddress + OFS_UCAxCTLW0) |= UCPEN;
            HWREG(baseAddress + OFS_UCAxCTLW0) |= UCPAR;
            break;
    }

    //Calculate Baud rate divider values for Modulation control registers
    if ( STATUS_FAIL == eUARTBAUDRATE_calculateBaudDividers(clockSourceFrequency,
             desiredUartBaudRate,
             &UCAxBRW_value,
             &UCAxMCTL_value,
             overSampling
             )){
        return ( STATUS_FAIL) ;
    }

    //Modulation Control Registers
    HWREG(baseAddress + OFS_UCAxBRW ) = UCAxBRW_value;
    HWREG(baseAddress + OFS_UCAxMCTLW) = UCAxMCTL_value;

    //Asynchronous mode & 8 bit character select & clear mode
    HWREG(baseAddress + OFS_UCAxCTLW0) &=  ~(UCSYNC +
                                             UC7BIT +
                                             UCMODE_3
                                             );

    //Configure  UART mode.
    HWREG(baseAddress + OFS_UCAxCTLW0) |= uartMode ;

    //Reset UCRXIE, UCBRKIE, UCDORM, UCTXADDR, UCTXBRK
    HWREG(baseAddress + OFS_UCAxCTLW0)  &= ~(UCRXEIE + UCBRKIE + UCDORM +
                                             UCTXADDR + UCTXBRK
                                             );

    return ( retVal) ;
}

//*****************************************************************************
//
//! Advanced initialization routine for the UART block. The values to be written
//! into the UCAxBRW and UCAxMCTLW registers should be pre-computed and passed
//! into the initialization function
//!
//! \param baseAddress is the base address of the UART module.
//! \param selectClockSource selects Clock source. Valid values are
//!         \b EUSCI_UART_CLOCKSOURCE_SMCLK
//!         \b EUSCI_UART_CLOCKSOURCE_ACLK
//! \param clockPrescalar is the value to be written into UCBRx bits
//! \param firstModReg  is First modulation stage register setting. This value 
//! 	is a pre-calculated value which can be obtained from the Device User’s 
//!		Guide.This value is written into UCBRFx bits of UCAxMCTLW.
//! \param secondModReg is Second modulation stage register setting. 
//! 	This value is a pre-calculated value which can be obtained from the Device 
//! 	User’s Guide. This value is written into UCBRSx bits of UCAxMCTLW.
//! \param parity is the desired parity. Valid values are
//!        \b EUSCI_UART_NO_PARITY  [Default Value],
//!        \b EUSCI_UART_ODD_PARITY,
//!        \b EUSCI_UART_EVEN_PARITY
//! \param msborLsbFirst controls direction of receive and transmit shift
//!     register. Valid values are
//!        \b EUSCI_UART_MSB_FIRST
//!        \b EUSCI_UART_LSB_FIRST [Default Value]
//! \param numberofStopBits indicates one/two STOP bits
//!      Valid values are
//!        \b EUSCI_UART_ONE_STOP_BIT [Default Value]
//!        \b EUSCI_UART_TWO_STOP_BITS
//! \param uartMode selects the mode of operation
//!      Valid values are
//!        \b EUSCI_UART_MODE  [Default Value],
//!        \b EUSCI_UART_IDLE_LINE_MULTI_PROCESSOR_MODE,
//!        \b EUSCI_UART_ADDRESS_BIT_MULTI_PROCESSOR_MODE,
//!        \b EUSCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE
//! \param overSampling indicates low frequency or oversampling baud generation
//!      Valid values are
//!        \b EUSCI_UART_OVERSAMPLING_BAUDRATE_GENERATION
//!        \b EUSCI_UART_LOW_FREQUENCY_BAUDRATE_GENERATION
//!
//! Upon successful initialization of the UART block, this function
//! will have initialized the module, but the UART block still remains
//! disabled and must be enabled with EUSCI_UART_enable()
//!
//! Modified bits are \b UCPEN, \b UCPAR, \b UCMSB, \b UC7BIT, \b UCSPB,
//! \b UCMODEx, \b UCSYNC bits of \b UCAxCTL0 and \b UCSSELx,
//! \b UCSWRST bits of \b UCAxCTL1
//!
//! \return STATUS_SUCCESS or
//!         STATUS_FAIL of the initialization process
//
//*****************************************************************************
unsigned short EUSCI_UART_initAdvance ( unsigned int baseAddress,
    unsigned char selectClockSource,
    unsigned int clockPrescalar,
    unsigned char firstModReg,
    unsigned char secondModReg,
    unsigned char parity,
    unsigned int msborLsbFirst,
    unsigned int numberofStopBits,
    unsigned int uartMode,
    unsigned short overSampling
    )
{
    ASSERT(
        (EUSCI_UART_MODE == uartMode) ||
        (EUSCI_UART_IDLE_LINE_MULTI_PROCESSOR_MODE == uartMode) ||
        (EUSCI_UART_ADDRESS_BIT_MULTI_PROCESSOR_MODE == uartMode) ||
        (EUSCI_UART_AUTOMATIC_BAUDRATE_DETECTION_MODE == uartMode)
        );

    ASSERT(
        (EUSCI_UART_CLOCKSOURCE_ACLK == selectClockSource) ||
        (EUSCI_UART_CLOCKSOURCE_SMCLK == selectClockSource)
        );

    ASSERT(
        (EUSCI_UART_MSB_FIRST == msborLsbFirst) ||
        (EUSCI_UART_LSB_FIRST == msborLsbFirst)
        );

    ASSERT(
        (EUSCI_UART_ONE_STOP_BIT == numberofStopBits) ||
        (EUSCI_UART_TWO_STOP_BITS == numberofStopBits)
        );

    ASSERT(
        (EUSCI_UART_NO_PARITY == parity) ||
        (EUSCI_UART_ODD_PARITY == parity) ||
        (EUSCI_UART_EVEN_PARITY == parity)
        );


    unsigned char retVal = STATUS_SUCCESS;

