dwijaybane/msp430/Source Files/eusci_uart.c
	//P1.2,3 = USCI_A0 TXD/RXD
	GPIO_setAsPeripheralModuleFunctionOutputPin(
			GPIO_PORT_P1,
			GPIO_PIN2
			);

	GPIO_setAsPeripheralModuleFunctionInputPin(
			GPIO_PORT_P1,
			GPIO_PIN3
			);

	//Initialize USCI UART module
	if ( STATUS_FAIL == EUSCI_UART_init(EUSCI_A0_BASE,
				 EUSCI_UART_CLOCKSOURCE_SMCLK,
				 UCS_getSMCLK(UCS_BASE),
				 BAUD_RATE,
				 EUSCI_UART_NO_PARITY,
				 EUSCI_UART_LSB_FIRST,
				 EUSCI_UART_ONE_STOP_BIT,
				 EUSCI_UART_MODE,
				 EUSCI_UART_LOW_FREQUENCY_BAUDRATE_GENERATION ))
	{
		return;
	}
	//Enable UART module for operation
	EUSCI_UART_enable(EUSCI_A0_BASE);
#ifdef INTERRUPT_MODE
	EUSCI_UART_enableInterrupt(EUSCI_A0_BASE,EUSCI_UART_TRANSMIT_INTERRUPT);	// Enable UART Interrupts.
	EUSCI_UART_enableInterrupt(EUSCI_A0_BASE,EUSCI_UART_RECEIVE_INTERRUPT);
#endif
	}
	else if(uartx==UARTA1)
	{

		//P1.4,5 = USCI_A1 TXD/RXD
		GPIO_setAsPeripheralModuleFunctionOutputPin(
				GPIO_PORT_P1,
				GPIO_PIN4
				);

		GPIO_setAsPeripheralModuleFunctionInputPin(
				GPIO_PORT_P1,
				GPIO_PIN5
				);

		//Initialize USCI UART module
		if ( STATUS_FAIL == EUSCI_UART_init(EUSCI_A1_BASE,
							 EUSCI_UART_CLOCKSOURCE_SMCLK,
							 UCS_getSMCLK(UCS_BASE),
							 BAUD_RATE,
							 EUSCI_UART_NO_PARITY,
							 EUSCI_UART_LSB_FIRST,
							 EUSCI_UART_ONE_STOP_BIT,
							 EUSCI_UART_MODE,
							 EUSCI_UART_LOW_FREQUENCY_BAUDRATE_GENERATION ))
		{
			return;
		}
		//Enable UART module for operation
		EUSCI_UART_enable(EUSCI_A1_BASE);
#ifdef INTERRUPT_MODE
	EUSCI_UART_enableInterrupt(EUSCI_A1_BASE,EUSCI_UART_TRANSMIT_INTERRUPT);	// Enable UART Interrupts.
	EUSCI_UART_enableInterrupt(EUSCI_A1_BASE,EUSCI_UART_RECEIVE_INTERRUPT);
#endif
	}
}
#ifdef POLLING_MODE
/*****************************************************************//**
* @brief        		Write The Data to UART Port Selected.
* @param[in]        	UART Module like uartA0,uartA1 AND Data.
* @return           	None
**********************************************************************/
void UART_Send(UartId_e uartx,char Data)
{
	if(uartx==UARTA0)
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A0_BASE,
						        EUSCI_UART_TRANSMIT_INTERRUPT_FLAG));
		EUSCI_UART_transmitData(EUSCI_A0_BASE,Data);
	}
	else if(uartx==UARTA1)
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A1_BASE,
				                EUSCI_UART_TRANSMIT_INTERRUPT_FLAG)) ;
		EUSCI_UART_transmitData(EUSCI_A1_BASE,Data);
	}
	else
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A2_BASE,
						        EUSCI_UART_TRANSMIT_INTERRUPT_FLAG)) ;
		EUSCI_UART_transmitData(EUSCI_A2_BASE,Data);
	}
}

unsigned int UART_Recieve(UartId_e uartx,char *data,int length,TRANSFER_BLOCK_Type uartm)
{
	unsigned int i;
	if(uartx==UARTA0)
	{
		for(i=0;i<length;i++)
		{
			while (!EUSCI_UART_getInterruptStatus(EUSCI_A0_BASE,
										   EUSCI_UART_RECEIVE_INTERRUPT_FLAG)) ;
			data[i] = UCA0RXBUF;
		}
	}
	else if(uartx==UARTA1)
	{
		if(uartm == BLOCKING)
		{
			for(i=0;i<length;i++)
			{
				while (!EUSCI_UART_getInterruptStatus(EUSCI_A1_BASE,
											   EUSCI_UART_RECEIVE_INTERRUPT_FLAG)) ;
				data[i] = UCA1RXBUF;
			}
		}
		else if(uartm == NONE_BLOCKING)
		{
			for(i=0;i<length;i++)
			{
				if(!EUSCI_UART_getInterruptStatus(EUSCI_A1_BASE,
											   EUSCI_UART_RECEIVE_INTERRUPT_FLAG))
				{
					data[i] = 0x00;
				}
				else
				{
					data[i] = UCA0RXBUF;
				}
			}
		}
		else if(uartm == TIME_BLOCKING)
		{
			unsigned long int time = 1250000;
			for(i=0;i<length;i++)
			{
				while(!EUSCI_UART_getInterruptStatus(EUSCI_A1_BASE,
											   EUSCI_UART_RECEIVE_INTERRUPT_FLAG))
				{
					time--;
					if(time == 0)
					{
						data[i] = 0x00;
					}
				}
			}
			data[i] = UCA0RXBUF;
		}
	}
}
#endif

#ifdef INTERRUPT_MODE
/*****************************************************************//**
* @brief        		Write The Data to UART Port Selected.
* @param[in]        	UART Module like uartA0,uartA1 AND Data.
* @return           	None
**********************************************************************/
void UART_Send(UartId_e uartx,char Data)
{
	if(uartx==UARTA0)
	{
		EUSCI_UART_transmitData(EUSCI_A0_BASE,Data);
	}
	else if(uartx==UARTA1)
	{
		EUSCI_UART_transmitData(EUSCI_A1_BASE,Data);
	}
}

unsigned int UART_Recieve(UartId_e uartx,unsigned char *data,int length)
{
	if(uartx == UARTA0)
	{
		while(r_flag == 0);

			unsigned int i;
			for(i=0;i<index;i++)
			{
				data[i] = uarta1_buffer[i];
				if(length == (index))
				{
					index = 0;
				}
			}
			r_flag = 0;
			return(i);


	}
	else
	{
		if(uartm == BLOCKING)
		{
			while(r_flag == 0);

			unsigned int i;
			for(i=0;i<index;i++)
			{
				data[i] = uarta1_buffer[i];
				if(length == (index))
				{
					index = 0;
				}
			}
			r_flag = 0;
			return(i);
		}
		else if(uartm == NONE_BLOCKING)
		{
			if(r_flag == 0)
			{
				data[i] = 0x00;
			}
			else
			{
				unsigned int i;
				for(i=0;i<index;i++)
				{
					data[i] = uarta1_buffer[i];
					if(length == (index))
					{
						index = 0;
					}
				}
				r_flag = 0;
			}
			return(i);
		}
		else if(uartm == TIME_BLOCKING)
		{
			unsigned int time = 50000;
			if(r_flag == 0)
			{
				time--;
				if(time == 0)
				{
					data[i] = 0x00;
				}
			}
			else
			{
				unsigned int i;
				for(i=0;i<index;i++)
				{
					data[i] = uarta1_buffer[i];
					if(length == (index))
					{
						index = 0;
					}
				}
				r_flag = 0;
			}
			return(i);
		}
	}

}
#endif

/*****************************************************************//**
* @brief        		Write The String of Data to UART Port Selected.
* @param[in]        	UART Module like uartA0,uartA1 AND String of Data.
* @return           	None
**********************************************************************/
void WriteDataStringUart(UartId_e uartx,char *String)
{
    int i = 0;
	while (String[i] != 0)
	{
		WriteDataUart(uartx,String[i]);
		i++;
	}
}
/**********************************************************************//**
* @brief        		Read the single byte of Data from UART Port Selected.
* @param[in]        	UART Module like uartA0,uartA1.
* @return           	Character Received from UART.
***************************************************************************/
char ReadDataUart(UartId_e uartx)
{
	if(uartx==UARTA0)
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A0_BASE,
		                       EUSCI_UART_RECEIVE_INTERRUPT_FLAG)) ;
		return(EUSCI_UART_receiveData(EUSCI_A0_BASE));
	}
	else if(uartx==UARTA1)
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A1_BASE,
				               EUSCI_UART_RECEIVE_INTERRUPT_FLAG)) ;
		return(EUSCI_UART_receiveData(EUSCI_A1_BASE));
	}
	else
	{
		while (!EUSCI_UART_getInterruptStatus(EUSCI_A2_BASE,
				               EUSCI_UART_RECEIVE_INTERRUPT_FLAG)) ;
	    return(EUSCI_UART_receiveData(EUSCI_A2_BASE));
	}
}

char printf(UartId_e uartx,char *format, ...)
{
	char hex[]= "0123456789ABCDEF";
	unsigned int width_dec[10] = { 1, 10, 100, 1000,10000};
	unsigned int width_hex[10] = { 0x1, 0x10, 0x100, 0x1000};
	unsigned int temp;

