dwijaybane/msp430/Source Files/eusci_uart.c
	char format_flag, fill_char,temp_data;
	unsigned long u_val, div_val;
	unsigned int base;

	char *ptr;
	va_list ap;
	va_start(ap, format);

	for(;;)
	{
		while((format_flag = *format++) != '%')      /* until full format string read */
		{
			if(!format_flag)
			{                        /* until '%' or '\0' */
				return(0);
			}
			UART_Send(uartx,format_flag);
			Delay_Ms(2);
		}
		switch(format_flag = *format++)
		{
			case 'c':
				format_flag = va_arg(ap,int);
				UART_Send(uartx,format_flag);
				Delay_Ms(2);

				continue;

			default:
				UART_Send(uartx,format_flag);
				Delay_Ms(2);

				continue;

			case 'b':
				format_flag = va_arg(ap,int);
				temp_data = (hex[(unsigned int)format_flag >> 4]);
				UART_Send(uartx,temp_data);
				Delay_Ms(2);
				temp_data = (hex[(unsigned int)format_flag & 0x0F]);
				UART_Send(uartx,temp_data);
				Delay_Ms(2);

				continue;

			case 's':
				ptr = va_arg(ap,char *);
				while(*ptr)
				{
					temp_data = (*ptr++);
					UART_Send(uartx,temp_data);
					Delay_Ms(2);
				}

				continue;

			case 'd':
				base = 10;
				if(*format == ' ')
				{
					format_flag = 0;
					//*format++;
				}
				else
				{
					fill_char = *format++;
					format_flag = ( *format++) - '1';

				}
				div_val = width_dec[format_flag];
				u_val = va_arg(ap,int);
				if(((int)u_val) < 0)
				{
					u_val = - u_val;    /* applied to unsigned type, result still unsigned */
					temp = '-';
					UART_Send(uartx,temp);
					Delay_Ms(2);
				}

				goto CONVER_LOOP;

			case 'x':
				base = 16;
				if(*format == ' ')
				{
					format_flag = 0;
					//*format++;
				}
				else
				{
					fill_char = *format++;
					format_flag = ( *format++) - '1';

				}
				div_val = width_hex[format_flag];
				u_val = va_arg(ap, int);


CONVER_LOOP:
				while(div_val > 1 && div_val > u_val)
				{
					div_val /= base;
					UART_Send(uartx,fill_char);
					Delay_Ms(2);
				}

				do
				{
					temp_data = (hex[u_val/div_val]);
					UART_Send(uartx,temp_data);
					Delay_Ms(2);
					u_val %= div_val;
					div_val /= base;
				}while(div_val);
			}/* end of switch statement */
		}
		return(0);
}

int getche(UartId_e uartx,TRANSFER_BLOCK_Type uartm)
{
	unsigned char len[1]={0};
	while(1)
	{
		UART_Recieve(uartx,len,1,uartm);
		while(len[0]>0)
		{
			if (len[0] == ENTER_KEY)
			{
				return(ENTER_KEY);
			}
			else if (len[0] == BACKSPACE_KEY)
			{
				return(BACKSPACE_KEY);
			}
			else if(len[0] == ESC_KEY)
			{
				Esc_Flag = 1;
				return(ESC_KEY);
			}
			else if ((len[0] >= 0x20) && (len[0] <= 0x7F))
			{
				return(len[0]);
			}
		}
	}
}

char getline(UartId_e uartx,char *s,unsigned int length,TRANSFER_BLOCK_Type uartm)
{
	unsigned int j = 0;
	unsigned int getline_data;
	while(1)
	{
		getline_data = getche(uartx,uartm);
		if(j < length)
		{
			if(getline_data == BACKSPACE_KEY)
			{
				s[j] = BACKSPACE_KEY;
				j++;
				Delay_Ms(10);
				s[j] = ' ';
				j++;
				Delay_Ms(10);
				s[j] = BACKSPACE_KEY;
				j++;
			}
			else if(getline_data == ENTER_KEY)
			{
				return j;
			}
			else if((getline_data >= ' ') && (getline_data <= 0x7F))
			{
				s[j] = getline_data;
				j++;
			}
		}
		else
		{
			UART_Send(uartx,BELL_KEY);
			if(getline_data == ENTER_KEY)
			{
				return j;
			}
			j++;
		}
	}
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
